# ThermalProperties Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalProperties Class
Members See Also
---
Class specific to thermal properties for assembly types, such as Wall, Floor, Ceiling, Roof and Building Pad.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ThermalProperties : APIObject
```

Visual Basic
---
```text
Public Class ThermalProperties _
	Inherits APIObject
```

Visual C++
---
```text
public ref class ThermalProperties : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ThermalProperties
# See Also
ThermalProperties Members
Autodesk.Revit.DB Namespace